ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
/*************************************************************************************************/
/*!
 *  \file
 *
 *  \brief      Baseband driver interface file.
 *
 *  Copyright (c) 2013-2019 Arm Ltd. All Rights Reserved.
 *
 *  Copyright (c) 2019-2020 Packetcraft, Inc.
 *  
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *  
 *      http://www.apache.org/licenses/LICENSE-2.0
 *  
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */
/*************************************************************************************************/

/*
 *
 *  NOTES:
 *
 *    While BB is enabled certain resources are consumed and are off limits during that time.
 *      Timer0 should not be touched while BB is enabled. It's available apart from that.
 *      PPI Channels 14 & 15 are used while BB is enabled. They are available apart from that.
 *
 *    Timer0's compare/capture registers are assigned specific uses:
 *      CC[0] - triggers radio TXEN or RXEN task, PPI triggered
 *      CC[1] - RX timeout
 *      CC[2] - captures *every* radio PAYLOAD event time, PPI triggered
 *      CC[3] - manual capture of current time
 *
 *    PPI Channel 14:
 *      Used to trigger TXEN or RXEN task on timer event COMPARE[0].
 *
 *    PPI Channel 15:
 *      Used to trigger timer capture to CC[2] on every radio PAYLOAD event.
 *
 *    If  BB_CLK_RATE_HZ == 32768 (low power mode):
 *
 *    Additional two channels of NRF RTC1 are controlled here.
 *      CC[1] - Compare value for NRF timer0 start task.
 *      CC[2] - Compare value for NRF HFCLK start task.
 */

#include "pal_types.h"
#include "pal_bb.h"
#include "pal_rtc.h"
#include "pal_bb.h"
#include "pal_led.h"
#include "pal_bb_ble.h"
#include "pal_radio.h"
#include "ll_defs.h"
#include "nrf.h"
#include "nrf_gpio.h"
#include "nrf_gpiote.h"
#include <string.h>

#if (LL_ENABLE_TESTER)
#include "ll_tester_api.h"
#endif

/**************************************************************************************************
  Macros
**************************************************************************************************/

#define PDU_HEADER_LEN              2
#define MAX_PAYLOAD_LEN             255
#define BB_DATA_PDU_LEN_OFFSET      1
#define BB_TRL_MAX_LEN              LL_DATA_MIC_LEN
#define BB_DATA_HDR_LEN             PDU_HEADER_LEN

#define MAX_TIFS_DEVIATION_USECS    (2 + 1) /* from spec, section 4.2.1 Active Clock Accuracy, 50ppm = 2usec */
                                            /*   +1 usec as a margin of uncertainty */

#if defined(NRF52840_XXAA) || defined(NRF52832_XXAA)
#define NRF5x_tTXEN_BLE_USECS       39      /* usec, Time between TXEN task and READY event, fast ramp mode (datasheet value of 40 is wrong). */
#define NRF5x_tRXEN_BLE_USECS       42      /* usec, Time between RXEN task and READY event, fast ramp mode (datasheet value of 40 is wrong). */
#else
/* from Nordic's Product Specification, section "Radio timing parameters" */
#define NRF5x_tTXEN_BLE_USECS       140     /* usec, Time between TXEN task and READY event  */
#define NRF5x_tRXEN_BLE_USECS       140     /* usec, Time between RXEN task and READY event  */
#endif

#if defined(NRF52840_XXAA) || defined(NRF52832_XXAA)
#define NRF5x_PROP_DELAY_TX_USECS   1       /* usec, (precise value is 0.6 usec) transmit propagation delay, START to first bit at antenna */
#define NRF5x_PROP_DELAY_RX_USECS   9       /* usec, (precise value is 9.4 usec), receive propagation delay, last bit at antenna to END */
#else
/* internal propagation delays obtained from Nordic support */
#define NRF5x_PROP_DELAY_TX_USECS   3       /* usec, transmit propagation delay, START to first bit at antenna */
#define NRF5x_PROP_DELAY_RX_USECS   3       /* usec, (precise value is 3.2 usec), receive propagation delay, last bit at antenna to END */
#endif

/* Nordic chip uses a one-byte prefix plus a three-byte base address to form the address */
#define NORDIC_PREFIX_LEN           1       /* prefix is a Nordic concept */
#define NORDIC_BASE_ADDR_LEN        3       /* base address is a Nordic concept */

/* scratch area for Nordic encryption engine */
#define ENC_CCM_DATA_STRUCT_LEN     33      /* length of CCM data structure used for encryption/decryption */
#define ENC_MAXPACKETSIZE           251     /* length used in MAXPACKETSIZE */
#define ENC_SCRATCH_BUF_LEN         ( 16 + ENC_MAXPACKETSIZE ) /* size of scratch area */
#define ENC_H_FIELD_LEN             1       /* length of "H" field */
#define ENC_LPLUS4_LEN              1       /* length of the "L+4" field */
#define ENC_RFU_LEN                 1       /* length of the "RFU" field */
#define ENC_MIC_LEN                 4       /* length of the MIC field */
#define ENC_TX_BUF_LEN              ( ENC_H_FIELD_LEN + ENC_LPLUS4_LEN + ENC_RFU_LEN + ENC_MAXPACKETSIZE )
#define ENC_OUTPUT_BUF_LEN          ( ENC_TX_BUF_LEN  + ENC_MIC_LEN )

/* +/- range for TIFS adjustment */
#define TIFS_ADJ_RANGE_USECS        8       /* the +/- maximums for TIFS adjustment */

/* adjust prescaler for the clock rate */
#if   (BB_CLK_RATE_HZ == 1000000)
  #define TIMER_PRESCALER   4
  #define TICKS_PER_USEC    1
#elif (BB_CLK_RATE_HZ == 2000000)
  #define TIMER_PRESCALER   3
  #define TICKS_PER_USEC    2
#elif (BB_CLK_RATE_HZ == 4000000)
  #define TIMER_PRESCALER   2
  #define TICKS_PER_USEC    4
#elif (BB_CLK_RATE_HZ == 8000000)
  #define TIMER_PRESCALER   1
  #define TICKS_PER_USEC    8
#elif (USE_RTC_BB_CLK)
  #define TIMER_PRESCALER   4       /* Use 1MHz for HFCLK */
  #define TICKS_PER_USEC    1
#else
  #error "Unsupported clock rate."
#endif

#if (USE_RTC_BB_CLK)
  #define TICKS_TO_USEC(ticks)      (ticks)  /* Use 1MHz for HFCLK */
#endif

#if defined(NRF52840_XXAA) || defined(NRF52832_XXAA)
/* for nRF52, stall until write buffer empties */
#define WAIT_FOR_WR_BUF_EMPTY(r)    ((void)r)
#else
/* for nRF51, no action required */
#define WAIT_FOR_WR_BUF_EMPTY(r)
#endif

