ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
#ifndef BB_ENABLE_INLINE_ENC_TX
#define BB_ENABLE_INLINE_ENC_TX     FALSE
#endif

#ifndef BB_ENABLE_INLINE_DEC_RX
#define BB_ENABLE_INLINE_DEC_RX     FALSE
#endif

#ifndef DIAG_PINS_ENA
#define DIAG_PINS_ENA               1
#endif

/* LED definitions */
#ifndef BB_LED_ENA
#define BB_LED_ENA             0
#endif

#if (BB_LED_ENA == 1)
#define BB_LED_1M_ON()        PalLedOn(0)
#define BB_LED_2M_ON()        PalLedOn(1)
#define BB_LED_CODED_ON()     PalLedOn(0); PalLedOn(1)
#define BB_LED_OFF()          PalLedOff(0); PalLedOff(1)
#else
#define BB_LED_1M_ON()
#define BB_LED_2M_ON()
#define BB_LED_CODED_ON()
#define BB_LED_OFF()
#endif

#if (AUDIO_CAPE == 1)
#define BB_LED_TX_ON()        PalLedOn(6)
#define BB_LED_TX_OFF()       PalLedOff(6)
#define BB_LED_RX_ON()        PalLedOn(7)
#define BB_LED_RX_OFF()       PalLedOff(7)
#else
#define BB_LED_TX_ON()
#define BB_LED_TX_OFF()
#define BB_LED_RX_ON()
#define BB_LED_RX_OFF()
#endif

/*! \brief convert little endian byte buffer to uint16_t. */
#define BYTES_TO_UINT16(n, p)     {n = ((uint16_t)(p)[0] + ((uint16_t)(p)[1] << 8));}

/**************************************************************************************************
  Typedefs
**************************************************************************************************/

/* driver states */
typedef enum
{
  NULL_STATE,
  SLEEP_STATE,
  IDLE_STATE,
  TX_STATE,
  RX_STATE,
  PRBS15_STATE
} bbDriverState_t;

/* TIFS states */
typedef enum
{
  TIFS_NULL,
  TIFS_TX_RAMPUP,
  TIFS_RX_RAMPUP
} bbTifsState_t;

/**************************************************************************************************
  Local Functions
**************************************************************************************************/
static void palBbTxHwRadioConfig(uint8_t * pTxBuf);
static void palBbRxHwRadioConfig(uint8_t * pRxBuf, uint16_t len);
static void palBbRadioHardStop(void);
static void palBbRestoreTrl(void);
static uint8_t *palBbGetTxData(PalBbBleTxBufDesc_t descs[], uint8_t cnt);

/* IRQ callback declarations. */
static void BbBleDrvTimerIRQHandler(void);
static void BbBleDrvRadioIRQHandler(void);

/**************************************************************************************************
  Local Variables
**************************************************************************************************/

volatile bbDriverState_t driverState = NULL_STATE;
volatile bbTifsState_t tifsState;
uint8_t bbRadioPcnf1WhiteEn;
PalBbBleTxIsr_t bbTxCallback = NULL;
PalBbBleRxIsr_t bbRxCallback = NULL;
uint32_t bbRxTimeoutUsec;
uint8_t * bbpRxBuf;
uint32_t bbAntennaDueTimeUsec;
uint32_t bbEventStartTime;
uint16_t bbDueOffsetUsec;
int8_t bbTxTifsAdj;
uint8_t bbChanIndex;
uint8_t bbTxPhy;
uint8_t bbRxPhy;
uint8_t bbTxPhyOptions;
uint8_t bbRxPhyOptions;
uint8_t tifsTxPhyOptions;
uint16_t bbTxLen;
bool_t bbEncryptTxFlag;
bool_t bbEncryptTxSuppressMic;
uint8_t bbEncryptTxBuf[ENC_TX_BUF_LEN+2];           /* add two for overrun protection */
uint8_t bbEncryptScratchBuf[ENC_SCRATCH_BUF_LEN+2]; /* add two for overrun protection */
uint8_t bbEncryptOutBuf[ENC_OUTPUT_BUF_LEN+2];      /* add two for overrun protection */
uint8_t bbEncryptCcmData[ENC_CCM_DATA_STRUCT_LEN];
uint8_t bbTrlSave[BB_TRL_MAX_LEN];
uint8_t *bbTrlSavedPtr = NULL;
uint8_t bbTrlSavedLen;
PalBbBleOpParam_t bbOpParam;

#ifndef BB_ASSERT_ENABLED
#define BB_ASSERT_ENABLED   FALSE
#endif
#if BB_ASSERT_ENABLED == TRUE
bool_t keySetFlag = 0;
bool_t ivSetFlag = 0;
bool_t packetCountSetFlag = 0;
#endif

#if (LL_ENABLE_TESTER == TRUE)
uint32_t bbRxAccAddr;
uint32_t bbTxAccAddr;
uint32_t bbRxCrcInit;
uint32_t bbTxCrcInit;
uint16_t bbModifyTxHdrMask = 0;
uint16_t bbModifyTxHdrValue = 0;
uint8_t bbTxCrcInitInvalidStep = 0;
uint8_t bbTxAccAddrInvalidStep = 0;
uint8_t bbRxCrcInitInvalidStep = 0;
uint8_t bbRxAccAddrInvalidStep = 0;
uint32_t bbTxCrcInitInvalidAdjMask = 0;
uint32_t bbTxAccAddrInvalidAdjMask = 0;
uint32_t bbRxCrcInitInvalidAdjMask = 0;
uint32_t bbRxAccAddrInvalidAdjMask = 0;
uint64_t bbTxCrcInitInvalidChanMask = 0;
uint64_t bbTxAccAddrInvalidChanMask = 0;
uint64_t bbRxCrcInitInvalidChanMask = 0;
uint64_t bbRxAccAddrInvalidChanMask = 0;
bool_t bbTxAccAddrShiftMask = FALSE;
bool_t bbRxAccAddrShiftMask = FALSE;
bool_t bbTxAccAddrShiftInc = FALSE;
bool_t invalidateAccAddrOnceRx = FALSE;
bool_t invalidateAccAddrOnceTx = FALSE;
#endif

/* enable BB assertions */
#ifdef BB_ENABLE_ASSERT
#define BB_ASSERT(x)       { if (!(X)) {  return; } }
#else
#define BB_ASSERT(x)
#endif

#ifdef BB_REQ_ALIGN
#define BB_ALIGN_ASSERT(pBuf)  { if (!((((uint32_t)(pBuf)) & 0x3) == 0)) {  return; } }
#else
#define BB_ALIGN_ASSERT(pBuf)
#endif

/* enable trace here or with conditional compilation */
#define xBB_TRACE

/////////////////////////////////////////////////////////////////////////////////
/* enable diagnostic here or via project level define */
#define xDIAGNOSTICS

/////////////////////////////////////////////////////////////////////////////////
#ifdef DIAGNOSTICS
typedef enum
{
  DIAG_NULL,
  DIAG_TX,
  DIAG_RX,
  DIAG_TX_TIFS,
  DIAG_RX_TIFS
} diag_op_t;

static void DiagFauxTxCallback(uint8_t status);
static void DiagFauxRxCallback(uint8_t status, int8_t rssi, uint32_t crc, uint32_t timestamp);

PalBbBleTxIsr_t diagTxCallback;
PalBbBleRxIsr_t diagRxCallback;

diag_op_t diagOp                   = DIAG_NULL;
diag_op_t diagOpLast               = DIAG_NULL;
uint8_t   diagLastStatus           = 0xFF;

/* transmit diagnostics */
uint16_t diagTxTotalCalls          = 0;
uint16_t diagTxCalls               = 0;
uint16_t diagTxTifsCalls           = 0;

uint16_t diagTxSuccess             = 0;
uint16_t diagTxFail                = 0;

uint16_t diagTxTifsSuccess         = 0;
uint16_t diagTxTifsFail            = 0;

uint16_t diagTxFailBadDueTime      = 0;
uint16_t diagTxFailMissedDueTime   = 0;
uint16_t diagTxBlueMoonWin         = 0;

uint16_t diagTxTifsFailMissed      = 0;
uint16_t diagTxTifsFailNotPossible = 0;
uint16_t diagTxTifsBlueMoonWin     = 0;

/* receive diagnostics */
uint16_t diagRxTotalCalls          = 0;
uint16_t diagRxCalls               = 0;
uint16_t diagRxTifsCalls           = 0;

uint16_t diagRxSuccess             = 0;
uint16_t diagRxFail                = 0;
uint16_t diagRxTimeout             = 0;
uint16_t diagRxCrcFail             = 0;

uint16_t diagRxTifsSuccess         = 0;
uint16_t diagRxTifsFail            = 0;
uint16_t diagRxTifsTimeout         = 0;
uint16_t diagRxTifsCrcFail         = 0;

uint16_t diagRxFailBadDueTime      = 0;
uint16_t diagRxFailMissedDueTime   = 0;
uint16_t diagRxBlueMoonWin         = 0;

uint16_t diagRxTifsFailMissed      = 0;
uint16_t diagRxTifsFailNotPossible = 0;
uint16_t diagRxTifsBlueMoonWin     = 0;

