ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
/* misc */
uint16_t diagCancels               = 0;
#endif
/////////////////////////////////////////////////////////////////////////////////

/*************************************************************************************************/
/*!
 *  \brief      Config GPIO as input or output.
 *
 *  \param      pin           Pin number.
 */
/*************************************************************************************************/
void PalBbGpioCfgOutput(uint32_t pin)
{
  nrf_gpio_cfg_output(pin);
}

/*************************************************************************************************/
/*!
 *  \brief      Set GPIO pin high.
 *
 *  \param      pin           Pin number.
 */
/*************************************************************************************************/
void PalBbGpioSet(uint32_t pin)
{
  nrf_gpio_pin_write(pin, 1);
}

/*************************************************************************************************/
/*!
 *  \brief      Set GPIO pin low.
 *
 *  \param      pin           Pin number.
 */
/*************************************************************************************************/
void PalBbGpioClear(uint32_t pin)
{
  nrf_gpio_pin_write(pin, 0);
}

/*************************************************************************************************/
/*!
 *  \brief      Toggle GPIO.
 *
 *  \param      pin           Pin number.
 *  \param      times         GPIO toggle times.
 */
/*************************************************************************************************/
void PalBbGpioToggle(uint32_t pin, uint32_t times)
{
  for (uint32_t i = 0; i < times; i++)
  {
    nrf_gpio_pin_write(pin, 1);
    nrf_gpio_pin_write(pin, 0);
  }
}

/*************************************************************************************************/
/*!
 *  \brief      Set radio mode.
 *
 *  \param      phy     PHY.
 *  \param      option  PHY option.
 */
/*************************************************************************************************/
static inline void palBbSetRadioMode(uint8_t phy, uint8_t option)
{
  switch(phy)
  {
    case BB_PHY_BLE_1M:
      NRF_RADIO->MODE = RADIO_MODE_MODE_Ble_1Mbit;
      break;

#if defined(NRF52832_XXAA) || defined(NRF52840_XXAA)
    case BB_PHY_BLE_2M:
      NRF_RADIO->MODE = RADIO_MODE_MODE_Ble_2Mbit;
      break;
#endif

#if defined(NRF52840_XXAA)
    case BB_PHY_BLE_CODED:
      if (option == BB_PHY_OPTIONS_BLE_S2)
      {
        NRF_RADIO->MODE = RADIO_MODE_MODE_Ble_LR500Kbit;
      }
      else
      {
        NRF_RADIO->MODE = RADIO_MODE_MODE_Ble_LR125Kbit;
      }
    break;
#endif

    default:
      NRF_RADIO->MODE = RADIO_MODE_MODE_Ble_1Mbit;
      break;
  }

  /* select LED according to client selection not actual PHY used */
  switch (bbRxPhy)
  {
    case BB_PHY_BLE_1M:
      BB_LED_1M_ON();
      break;
    case BB_PHY_BLE_2M:
      BB_LED_2M_ON();
      break;
    case BB_PHY_BLE_CODED:
      BB_LED_CODED_ON();
      break;
    default:
      break;
  }

#if defined(NRF52832_XXAA)
  *(volatile uint32_t*)0x40001777 = 0UL;   /* Disable fault tolerant AA correlator. */
#endif
}

#if (USE_RTC_BB_CLK)
/*************************************************************************************************/
/*!
 *  \brief      Set the time for the timer0 to start.
 *
 *  \param      startTime     timer0 start time.
 *
 */
/*************************************************************************************************/
static void palBbStartTimer(uint32_t startTime)
{
  bbEventStartTime = NRF_RTC1->CC[1] = startTime;
  NRF_RTC1->EVENTS_COMPARE[1] = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_RTC1->EVENTS_COMPARE[1]);
}
#endif

/*************************************************************************************************/
/*!
 *  \brief      Low power operation.
 *
 *  \note       Called by upper baseband code.
 */
/*************************************************************************************************/
void PalBbBleLowPower(void)
{
  /* Stop high frequency timer between BLE events if low lower mode. */
#if (USE_RTC_BB_CLK)
  NRF_TIMER0->TASKS_STOP = 1;
  NRF_TIMER0->TASKS_CLEAR = 1;
#endif
}

#if (BB_ENABLE_INLINE_ENC_TX || BB_ENABLE_INLINE_DEC_RX)
/*************************************************************************************************/
/*!
 *  \brief      Enable or disable inline encryption on transmit.
 *
 *  \param      enable  Boolean flag to enable or disable TX encryption
 *
 */
/*************************************************************************************************/
static void palBbBleInlineEncryptTxEnable(bool_t enable)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  /* copy encryption enable to global variable */
  bbEncryptTxFlag = enable;
}

/*************************************************************************************************/
/*!
 *  \brief      Set inline encryption/decryption MIC suppression.
 *
 *  \param      enable  Boolean flag to indicate if MIC is suppressed
 *
 */
/*************************************************************************************************/
static void palBbBleInlineEncryptDecryptSuppressMic(bool_t enable)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  /* copy to global variable */
  bbEncryptTxSuppressMic = enable;
}

/*************************************************************************************************/
/*!
 *  \brief      Set inline encryption/decryption key.
 *
 *  \param      key     Pointer to 16-byte key value
 *
 */
/*************************************************************************************************/
static void palBbBleInlineEncryptDecryptSetKey(uint8_t *pKey)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  #if BB_ASSERT_ENABLED == TRUE
  keySetFlag = 1;
  #endif

  /* populate encryption structure with reversed stored key */
  for (unsigned int i=0; i<16; i++)
  {
    bbEncryptCcmData[i] = pKey[15-i];
  }
}

/*************************************************************************************************/
/*!
 *  \brief      Set inline encryption/decryption IV (initialization vector).
 *
 *  \param      key     Pointer to 8-byte value for IV
 *
 */
/*************************************************************************************************/
static void palBbBleDrvInlineEncryptDecryptSetIv(uint8_t *pIV)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  #if BB_ASSERT_ENABLED == TRUE
  ivSetFlag = 1;
  #endif

  /* populate encryption structure with reversed stored IV */
  memcpy(&bbEncryptCcmData[25], pIV, 8);
}

/*************************************************************************************************/
/*!
 *  \brief      Set inline encryption/decryption direction bit.
 *
 *  \param      dir     0=slave, non-zero=master
 *
 */
/*************************************************************************************************/
void PalBbBleInlineEncryptDecryptSetDirection(uint8_t dir)
{
  if (dir)
  {
    /* master */
    bbEncryptCcmData[24] = 1;
  }
  else
  {
    bbEncryptCcmData[24] = 0;
  }
}

/*************************************************************************************************/
/*!
 *  \brief      Set the inline encryption packet count for transmit.
 *
 *  \param      count   Packet counter value, a 39-bit value
 *
 */
/*************************************************************************************************/
void PalBbBleInlineEncryptSetPacketCount(uint64_t count)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  #if BB_ASSERT_ENABLED == TRUE
  packetCountSetFlag = 1;
  #endif

  /* populate packet counter */
  bbEncryptCcmData[16] = (count >>  0) & 0xFF;
  bbEncryptCcmData[17] = (count >>  8) & 0xFF;
  bbEncryptCcmData[18] = (count >> 16) & 0xFF;
  bbEncryptCcmData[19] = (count >> 24) & 0xFF;
  bbEncryptCcmData[20] = (count >> 32) & 0x7F; /* only 7-bits of MSB are used (packet count is 39 bits) */
}
#endif

/*************************************************************************************************/
/*!
 *  \brief      Initialize the BLE baseband driver.
 *
 *  One-time initialization of BLE baseband driver.
 */
/*************************************************************************************************/
void PalBbBleInit(void)
{
  BB_ASSERT( LL_AA_LEN == (NORDIC_PREFIX_LEN + NORDIC_BASE_ADDR_LEN) ); /* internal integrity check */
  BB_ASSERT(driverState == NULL_STATE); /* driver should only be initialized once */

  /* initialize callback routines to NULL */
  bbTxCallback = NULL;
  bbRxCallback = NULL;

  /* give timeout an initial value, used by assert */
  bbRxTimeoutUsec = 0;

#if defined(NRF52840_XXAA) || defined(NRF52832_XXAA)
  NRF_RADIO->MODECNF0 = RADIO_MODECNF0_RU_Fast << RADIO_MODECNF0_RU_Pos;
#endif

#if defined(NRF51)
  /* if available, copy in the factory radio calibration values  */
  if ((NRF_FICR->OVERRIDEEN & FICR_OVERRIDEEN_BLE_1MBIT_Msk) == 0)
  {
    NRF_RADIO->OVERRIDE0 =  NRF_FICR->BLE_1MBIT[0];
    NRF_RADIO->OVERRIDE1 =  NRF_FICR->BLE_1MBIT[1];
    NRF_RADIO->OVERRIDE2 =  NRF_FICR->BLE_1MBIT[2];
    NRF_RADIO->OVERRIDE3 =  NRF_FICR->BLE_1MBIT[3];
    NRF_RADIO->OVERRIDE4 =  NRF_FICR->BLE_1MBIT[4] | RADIO_OVERRIDE4_ENABLE_Msk;
  }
#endif

  /* CRC configuration */
  NRF_RADIO->CRCCNF  = LL_CRC_LEN | RADIO_CRCCNF_SKIP_ADDR_Msk;  /* set length, skip address as part of CRC */
  NRF_RADIO->CRCPOLY = 0x0000065B;  /* crc polynomial, value from bluetooth spec */

  /* set logical address 0 for transmit (uses PREFIX0.AP0/BASE0 pair) */
  NRF_RADIO->TXADDRESS = 0;

  /* enable receive address on logical address 0 (uses PREFIX0.AP0/BASE0 pair) */
  NRF_RADIO->RXADDRESSES = 1;  /* NOTE: this is a bitmask, a '1' enables logical address 0 */

  /* set default direction in CCM structure */
  bbEncryptCcmData[24] = 0;  /* 0=slave, 1=master */

  /* set default value for data whitening */
  bbRadioPcnf1WhiteEn = RADIO_PCNF1_WHITEEN_Enabled;

