ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
  /* set initial value for TIFS adjustment */
  bbTxTifsAdj = 0;

  /* set default of no encryption */
  bbEncryptTxFlag = 0;

#if (USE_RTC_BB_CLK)
  NRF_RTC1->EVTENCLR = RTC_EVTENCLR_COMPARE1_Msk;
  NRF_RTC1->EVTENCLR = RTC_EVTENCLR_COMPARE2_Msk;
#endif

  /* update driver state */
  driverState = SLEEP_STATE;

  /////////////////////////////////////////////////////////////////////////////////
  #if BB_ASSERT_ENABLED
  /* initialize buffers with 0xAA's, last two bytes used by assert to detect buffer overrun */
  memset(bbEncryptTxBuf,      0xAA, sizeof(bbEncryptTxBuf));
  memset(bbEncryptOutBuf,     0xAA, sizeof(bbEncryptOutBuf));
  memset(bbEncryptScratchBuf, 0xAA, sizeof(bbEncryptScratchBuf));
  #endif
  /////////////////////////////////////////////////////////////////////////////////

  bbTxPhyOptions = BB_PHY_OPTIONS_DEFAULT;
  bbRxPhyOptions = BB_PHY_OPTIONS_DEFAULT;
  tifsTxPhyOptions = BB_PHY_OPTIONS_DEFAULT;

  PalBbRegisterProtIrq(BB_PROT_BLE, BbBleDrvTimerIRQHandler, BbBleDrvRadioIRQHandler);
  PalBbRegisterProtIrq(BB_PROT_BLE_DTM, BbBleDrvTimerIRQHandler, BbBleDrvRadioIRQHandler);
}

/*************************************************************************************************/
/*!
 *  \brief      Enable the BB hardware.
 *
 *  Wake the BB hardware out of sleep and enable for operation. All BB functionality is
 *  available when this routine completes. BB clock is set to zero and started.
 */
/*************************************************************************************************/
void PalBbBleEnable(void)
{
  /* Give the BB the highest priority. */
  NVIC_SetPriority(RADIO_IRQn, 0);
  NVIC_SetPriority(TIMER0_IRQn, 0);

  BB_ASSERT(NVIC_GetPriority(RADIO_IRQn) == NVIC_GetPriority(TIMER0_IRQn)); /* BB driver related interrupts must have same priority */
  BB_ASSERT(driverState == SLEEP_STATE); /* the BB driver should never be re-enabled */
  BB_ASSERT(NRF_CLOCK->HFCLKSTAT & CLOCK_HFCLKSTAT_STATE_Msk); /* HF clock must be running */
#if (USE_RTC_BB_CLK)
  if (!(NRF_CLOCK->HFCLKSTAT & CLOCK_HFCLKSTAT_SRC_Msk))
  {
    NRF_CLOCK->TASKS_HFCLKSTART = 1;
  }

#else
  BB_ASSERT(NRF_CLOCK->HFCLKSTAT & CLOCK_HFCLKSTAT_SRC_Msk);   /* HF clock source must be the crystal */
#endif

  /* stop timer if it was somehow running (timer must be stopped for configuration) */
  NRF_TIMER0->TASKS_STOP  = 1;

  /* clear timer to zero count */
  NRF_TIMER0->TASKS_CLEAR = 1;

  /* configure timer */
  NRF_TIMER0->MODE      = TIMER_MODE_MODE_Timer;
  NRF_TIMER0->BITMODE   = TIMER_BITMODE_BITMODE_32Bit;
  NRF_TIMER0->PRESCALER = TIMER_PRESCALER;  /* f = 16MHz / (2 ^ TIMER_PRESCALER),  for TIMER_PRESCALER of 4, clock has 1us resolution
                                                                                       TIMER_PRESCALER of 3, clock is 0.5us resolution
                                                                                       TIMER_PRESCALER of 2, clock is 0.25us resolution
                                                                                       TIMER_PRESCALER of 1, clock is 0.125us resolution  */

  /*
   *   Configure the PPI Channel 13 -  "Chan 13: RTC.COMPARE[0] -> TIMER[0].START"
   *
   *   This channel is used to trigger starting TIMER[0] for radio operations.
   */
#if (USE_RTC_BB_CLK)
  /* timer0 starts when RTC0.COMPARE[1] event is triggered */
  NRF_PPI->CH[13].EEP = (uint32_t) &NRF_RTC1->EVENTS_COMPARE[1];
  NRF_PPI->CH[13].TEP = (uint32_t) &NRF_TIMER0->TASKS_START;
  NRF_PPI->CHENSET = PPI_CHENSET_CH13_Msk;                                        /* enable channel */

  /* HFCLK starts when RTC0.COMPARE[2] event is triggered */
  NRF_PPI->CH[10].EEP = (uint32_t) &NRF_RTC1->EVENTS_COMPARE[2];
  NRF_PPI->CH[10].TEP = (uint32_t) &NRF_CLOCK->TASKS_HFCLKSTART;
  NRF_PPI->CHENSET = PPI_CHENSET_CH10_Msk;                                        /* enable channel */
#else
  /* timer0 is a free running clock */
  NRF_TIMER0->TASKS_START = 1;
#endif

  /*
   *   Configure the PPI Channel 14 -  "Chan 14: TIMER[0].COMPARE[0] -> TXEN/RXEN"
   *
   *   This channel is used to trigger radio task TXEN, or RXEN, on timer event COMPARE[0].
   *   It is only enabled when needed. The PPI task parameter is meant to be configured just
   *   before the channel is enabled. This task will be either TXEN or RXEN depending on radio
   *   operation. The event is static and never changes. It is configured below.
   */
  NRF_PPI->CH[14].EEP = (uint32_t) &NRF_TIMER0->EVENTS_COMPARE[0];   /* configure event */

  /*
   *   Configure and enable PPI Channel 15 -  "Chan 15: PAYLOAD -> CAPTURE[2]"
   *
   *   This channel is used to capture the timer value on every radio PAYLOAD event.
   *   It is configured to trigger timer task CAPTURE[2] which copies the timer to CC[2].
   *
   *   Once this channel is set up and enabled, it requires no further action.
   *   It will stay active until the BB driver is disabled.
   */
  NRF_PPI->CH[15].EEP = (uint32_t) &NRF_RADIO->EVENTS_PAYLOAD;        /* configure event */
  NRF_PPI->CH[15].TEP = (uint32_t) &NRF_TIMER0->TASKS_CAPTURE[2];     /* configure task */
  NRF_PPI->CHENSET = PPI_CHENSET_CH15_Msk;                            /* enable channel */

  /*
   *   NOTE: Per Nordic support team response, PPI channels do not require a reset.
   *         The PPI configured event will trigger the configured task every time it happens,
   *         regardless if the EVENT register is cleared or not.  (This is not clear from the
   *         reference manual.)
   */

  /* clear out and enable TIMER0 interrupts at system level */
  NRF_TIMER0->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(TIMER0_IRQn);
  NVIC_EnableIRQ(TIMER0_IRQn);

  /* clear out and enable RADIO interrupts at system level */
  NRF_RADIO->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(RADIO_IRQn);
  NVIC_EnableIRQ(RADIO_IRQn);

  /* clear out and enable CCM/AAR interrupts at system level */
  NRF_CCM->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(CCM_AAR_IRQn);
  NVIC_EnableIRQ(CCM_AAR_IRQn);

