ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
   /*
    *  Enable all the radio interrupts that are used. Per design, these are to
    *  be left on as long as the BB driver is enabled.
    */

#if (USE_RTC_BB_CLK)
  NRF_RTC1->EVTENSET = RTC_EVTENSET_COMPARE1_Msk;
  NRF_RTC1->EVTENSET = RTC_EVTENSET_COMPARE2_Msk;
#endif

  /* enable the radio "TIFS Expired" interrupt (triggers on radio PAYLOAD event) */
  NRF_RADIO->EVENTS_READY = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_READY);
  NRF_RADIO->INTENSET = RADIO_INTENSET_READY_Msk;

  /* enable the radio "Timestamp/TIFS Setup" interrupt (triggers on radio PAYLOAD event) */
  NRF_RADIO->EVENTS_PAYLOAD = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_PAYLOAD);
  NRF_RADIO->INTENSET = RADIO_INTENSET_PAYLOAD_Msk;

  /* enable the radio "TX-RX Complete" interrupt (triggers on radio END event) */
  NRF_RADIO->EVENTS_DISABLED = 0;
  NRF_RADIO->EVENTS_END = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_END);
  NRF_RADIO->INTENSET = RADIO_INTENSET_END_Msk;

  /* put the radio is a definite know state */
  palBbRadioHardStop();
}

/*************************************************************************************************/
/*!
 *  \brief      Disable the BB hardware.
 *
 *  Disable the baseband and put radio hardware to sleep. Must be called from an idle state.
 *  A radio operation cannot be in progress.
 */
/*************************************************************************************************/
void PalBbBleDisable(void)
{
  BB_ASSERT(driverState == IDLE_STATE); /* can only disable if radio is idle */

  /* slight chance that a TIFS operation is ramping up, this will stop it */
  palBbRadioHardStop();

  /* stop timer */
  PalBbBleLowPower();

  /* disable PPI channels */
  NRF_PPI->CHENCLR = PPI_CHENCLR_CH14_Msk;   /* Chan 14: COMPARE[0] -> TXEN/RXEN */
  NRF_PPI->CHENCLR = PPI_CHENCLR_CH15_Msk;   /* Chan 15: PAYLOAD -> CAPTURE[2] */

#if (USE_RTC_BB_CLK)
  NRF_RTC1->EVTENCLR = RTC_EVTENCLR_COMPARE1_Msk;
  NRF_RTC1->EVTENCLR = RTC_EVTENCLR_COMPARE2_Msk;
#endif

  /* disable and clean up TIMER0 interrupts */
  NVIC_DisableIRQ(TIMER0_IRQn);
  NRF_TIMER0->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(TIMER0_IRQn);

  /* disable and clean up RADIO interrupts */
  NVIC_DisableIRQ(RADIO_IRQn);
  NRF_RADIO->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(RADIO_IRQn);

  /* disable and clean up CCM/AAR interrupts */
  NVIC_DisableIRQ(CCM_AAR_IRQn);
  NRF_CCM->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(CCM_AAR_IRQn);

  /* update driver state */
  driverState = SLEEP_STATE;
}

/*************************************************************************************************/
/*!
 *  \brief      Set the packet transmit completion handler.
 *
 *  \param      pParam     Callback called upon the completion of a transmit operation.
 *
 *  The given \a txCback routine is called once and only once in response to \a BbDrvTx(). It
 *  should be called in the ISR context due to the transmit completion interrupt from the BB.
 *  If \a BbDrvTxCancel() is called with a return value of TRUE, \a txCback must not be executed.
 */
/*************************************************************************************************/
void PalBbBleSetDataParams(const PalBbBleDataParam_t *pParam)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */
  BB_ASSERT(pParam->txCback != NULL); /* must be set to something */
  BB_ASSERT(pParam->rxCback != NULL); /* must be set to something */

  /* store the callback function addresses to local memory */
  bbTxCallback = pParam->txCback;
  bbRxCallback = pParam->rxCback;

  /* store due time for future use */
  bbAntennaDueTimeUsec = pParam->dueUsec;

  /* store timeout value for future use */
  bbRxTimeoutUsec = pParam->rxTimeoutUsec;

  /////////////////////////////////////////////////////////////////////////////////
  #ifdef DIAGNOSTICS
  bbTxCallback = DiagFauxTxCallback;
  diagTxCallback = pParam->txCback;
  bbRxCallback = DiagFauxRxCallback;
  diagRxCallback = pParam->rxCback;
  #endif
  /* for diagnostic purposes, an override scheme where all callbacks pass through an internal path. */
  /////////////////////////////////////////////////////////////////////////////////
}

/*************************************************************************************************/
/*!
 *  \brief      Set the operation parameters.
 *
 *  \param      pOpParam    Operations parameters.
 *
 *  Calling this routine will set parameters for the next transmit or receive operations.
 */
/*************************************************************************************************/
void PalBbBleSetOpParams(const PalBbBleOpParam_t *pOpParam)
{
  bbOpParam = *pOpParam;
}

/*************************************************************************************************/
/*!
 *  \brief      Set channelization parameters.
 *
 *  \param      pChan      Channelization parameters.
 */
/*************************************************************************************************/
static void palBbBleSetChannelParam(PalBbBleChan_t *pChan)
{
  uint8_t rfChan;
  int8_t  txPower;

  /* get the channel index into a local variable, for efficiency */
  bbChanIndex = pChan->chanIdx;

  /* save the PHYs */
  bbTxPhy = pChan->txPhy;
  bbRxPhy = pChan->rxPhy;
  bbTxPhyOptions = pChan->initTxPhyOptions;
  tifsTxPhyOptions = pChan->tifsTxPhyOptions;

  BB_ASSERT((pChan->txPhy == BB_PHY_BLE_1M) ||
            (pChan->txPhy == BB_PHY_BLE_2M) ||
            (pChan->txPhy == BB_PHY_BLE_CODED));
  BB_ASSERT((pChan->rxPhy == BB_PHY_BLE_1M) ||
            (pChan->rxPhy == BB_PHY_BLE_2M) ||
            (pChan->rxPhy == BB_PHY_BLE_CODED));

  /* convert channel index to RF channel, per bluetooth specification */
  rfChan = 0; /* initialize to zero to suppress compiler 'uninitialized' warning */
  if (bbChanIndex <= 10)        {  rfChan = bbChanIndex + 1;  }
  else if (bbChanIndex <= 36)   {  rfChan = bbChanIndex + 2;  }
  else if (bbChanIndex == 37)   {  rfChan = 0;   }
  else if (bbChanIndex == 38)   {  rfChan = 12;  }
  else if (bbChanIndex == 39)   {  rfChan = 39;  }
  else
  {
    BB_ASSERT(0); /* illegal channel index */
  }

  /* set the radio frequency */
  NRF_RADIO->FREQUENCY = 2 + (rfChan * 2);  /* over-the-air freq = 2400Hz + value in FREQUENCY */

  /* set the data whitening initial value, based on channel index per bluetooth spec */
  NRF_RADIO->DATAWHITEIV = bbChanIndex | 0x40;  /* position zero is always '1', it gets "or'ed" in here with 0x40 */

