ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
  /* set access addresses for logical address 0, which uses the PREFIX0.AP0/BASE0 pair */
  NRF_RADIO->PREFIX0 = (pChan->accAddr & 0xFF000000) >> 24;
  NRF_RADIO->BASE0   = (pChan->accAddr & 0x00FFFFFF) <<  8;

#if (LL_ENABLE_TESTER == TRUE)
  /* store access address overrides */
  bbRxAccAddr = pChan->accAddrRx;
  bbTxAccAddr = pChan->accAddrTx;
#endif

  /* set initial CRC */
  NRF_RADIO->CRCINIT = pChan->crcInit;

#if (LL_ENABLE_TESTER == TRUE)
  /* store CRC init overrides */
  bbRxCrcInit = pChan->crcInitRx;
  bbTxCrcInit = pChan->crcInitTx;
#endif

  /* get the transmit power into a local variable, for efficiency */
  txPower = pChan->txPower;

#if defined(NRF52840_XXAA)
  if      (txPower >=   8)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos8dBm;   txPower =   8;  }
  else if (txPower >=   7)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos7dBm;   txPower =   7;  }
  else if (txPower >=   6)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos6dBm;   txPower =   6;  }
  else if (txPower >=   5)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos5dBm;   txPower =   5;  }
  else if (txPower >=   4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos4dBm;   txPower =   4;  }
  else if (txPower >=   3)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos3dBm;   txPower =   3;  }
  else if (txPower >=   2)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos2dBm;   txPower =   2;  }
  else if (txPower >=   0)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_0dBm;      txPower =   0;  }
  else if (txPower >=  -4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg4dBm;   txPower =  -4;  }
  else if (txPower >=  -8)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg8dBm;   txPower =  -8;  }
  else if (txPower >= -12)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg12dBm;  txPower = -12;  }
  else if (txPower >= -16)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg16dBm;  txPower = -16;  }
  else if (txPower >= -20)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg20dBm;  txPower = -20;  }
  else                      {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg40dBm;  txPower = -40;  }
#elif defined(NRF52832_XXAA)
  if      (txPower >=   4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos4dBm;   txPower =   4;  }
  else if (txPower >=   3)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos3dBm;   txPower =   3;  }
  else if (txPower >=   0)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_0dBm;      txPower =   0;  }
  else if (txPower >=  -4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg4dBm;   txPower =  -4;  }
  else if (txPower >=  -8)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg8dBm;   txPower =  -8;  }
  else if (txPower >= -12)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg12dBm;  txPower = -12;  }
  else if (txPower >= -16)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg16dBm;  txPower = -16;  }
  else if (txPower >= -20)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg20dBm;  txPower = -20;  }
  else                      {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg40dBm;  txPower = -40;  }
#else
  if      (txPower >=   4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos4dBm;   txPower =   4;  }
  else if (txPower >=   0)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_0dBm;      txPower =   0;  }
  else if (txPower >=  -4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg4dBm;   txPower =  -4;  }
  else if (txPower >=  -8)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg8dBm;   txPower =  -8;  }
  else if (txPower >= -12)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg12dBm;  txPower = -12;  }
  else if (txPower >= -16)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg16dBm;  txPower = -16;  }
  else if (txPower >= -20)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg20dBm;  txPower = -20;  }
  else                      {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg30dBm;  txPower = -30;  }
#endif

  /* set the power parameter to the value that was actually set in hardware */
  pChan->txPower = txPower;

#if (BB_ENABLE_INLINE_ENC_TX || BB_ENABLE_INLINE_DEC_RX)
  /* enable inline encryption */
  palBbBleInlineEncryptTxEnable(pChan->enc.enaEncrypt);

  /* set encryption parameters */
  if (pChan->enc.enaEncrypt || pChan->enc.enaDecrypt)
  {
    palBbBleInlineEncryptDecryptSuppressMic(FALSE); /* TODO add MIC suppression */
    palBbBleInlineEncryptDecryptSetKey(pChan->enc.sk);
    palBbBleDrvInlineEncryptDecryptSetIv(pChan->enc.iv);
    PalBbBleInlineEncryptDecryptSetDirection(pChan->enc.dir);
  }
#endif
}

/*************************************************************************************************/
/*!
 *  \brief      Set channelization parameters.
 *
 *  \param      pChan      Channelization parameters.
 *
 *  Calling this routine will set these parameters for all future transmit and receive operations
 *  until this routine is called again providing new parameters.
 *
 *  The setting of channelization parameters influence the operations of the following listed
 *  routines. Therefore, this routine is called to set the channel characteristics before
 *  the use of these listed packet routines.
 *
 *  - \a BbDrvTx()
 *  - \a BbDrvRx()
 *  - \a BbDrvTxTifs()
 *  - \a BbDrvRxTifs()
 *
 *  \note       The \a pParam contents are not guaranteed to be static and is only valid in the
 *              context of the call to this routine. Therefore parameters requiring persistence
 *              should be copied.
 */
/*************************************************************************************************/
void PalBbBleSetChannelParam(PalBbBleChan_t *pChan)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  /* stop any TIFS operation that might be ramping up */
  palBbRadioHardStop();

  palBbBleSetChannelParam(pChan);
}

/*************************************************************************************************/
/*!
 *  \brief      Enable or disable data whitening.
 *
 *  \param      enable       flag to indicate data whitening
 *
 *  Sets an internal variable that indicates if data whitening is enabled or not.
 *  The value is used later when setting PCNF1 at beginning of TX or RX.
 */
/*************************************************************************************************/
void PalBbBleEnableDataWhitening(bool_t enable)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  /* assume disabled */
  bbRadioPcnf1WhiteEn = RADIO_PCNF1_WHITEEN_Disabled;

