ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
  NRF_TIMER0->CC[0] = bbDueOffsetUsec;
  NRF_TIMER0->EVENTS_COMPARE[0] = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_TIMER0->EVENTS_COMPARE[0]);
  palBbStartTimer(txStart);
#else
  BB_ASSERT(bbDueOffsetUsec == 0);     /* Always 0 with HFCLK. */
  NRF_TIMER0->CC[0] = txStart;
  NRF_TIMER0->EVENTS_COMPARE[0] = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_TIMER0->EVENTS_COMPARE[0]);
#endif

  /* configure radio hardware registers for transmit */
  palBbTxHwRadioConfig(pBuf);

  /* set shortcuts to transmit as soon as radio warms up */
  NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk   |
                      RADIO_SHORTS_END_DISABLE_Msk;

  uint32_t currentBbTick;
  (void)PalBbGetTimestamp(&currentBbTick);

  /* see if the due time is in the past (or a very long way, away) */
#if (USE_RTC_BB_CLK)
  if ((txStart - currentBbTick) & 0x00800000) /* Check MSB of 24 bit RTC counter. */
#else
  if ((txStart - currentBbTick) & 0x80000000)
#endif
  {
    /////////////////////////////////////////////////////////////////////////////////
    #ifdef DIAGNOSTICS
    diagTxFailBadDueTime++;
    #endif
    /////////////////////////////////////////////////////////////////////////////////

    /* run the callback function */
    palBbRestoreTrl();
    bbTxCallback(BB_STATUS_FAILED);
    return;
  }

  /* configure and enable PPI Chan 14, COMPARE[0] -> TXEN */
  NRF_PPI->CH[14].TEP = (uint32_t) &NRF_RADIO->TASKS_TXEN;  /* configure task */
  NRF_PPI->CHENSET = PPI_CHENSET_CH14_Msk;                  /* enable channel */

  /* see if the compare point was already reached */
  if (NRF_TIMER0->EVENTS_COMPARE[0])
  {
    /* it's 99.99999% certain did not make it, but... maybe, just maybe... */
    if (NRF_RADIO->STATE == RADIO_STATE_STATE_Disabled)
    {
      /////////////////////////////////////////////////////////////////////////////////
      #ifdef DIAGNOSTICS
      diagTxFailMissedDueTime++;
      #endif
      /////////////////////////////////////////////////////////////////////////////////

      /* run the callback function */
      palBbRestoreTrl();
      bbTxCallback(BB_STATUS_FAILED);
      return;
    }

    /////////////////////////////////////////////////////////////////////////////////
    #ifdef DIAGNOSTICS
    diagTxBlueMoonWin++;
    #endif
    /////////////////////////////////////////////////////////////////////////////////
  }

  /* update the driver state */
  driverState = TX_STATE;
}

/*************************************************************************************************/
/*!
 *  \brief      Transmit packet on TIFS timing.
 *
 *  \param      descs       Transmit data buffer descriptor.
 *  \param      cnt         Transmit data count.
 *
 *  If possible, the transmit will occur at the TIFS timing. If not possible, the callback status
 *  will indicate this.
 */
/*************************************************************************************************/
void PalBbBleTxTifsData(PalBbBleTxBufDesc_t descs[], uint8_t cnt)
{
  uint8_t *pBuf = palBbGetTxData(descs, cnt);

  BB_ASSERT(driverState == IDLE_STATE);                       /* driver must be idle */
  BB_ASSERT(bbTxCallback != NULL);                            /* callback must be configured */
  BB_ALIGN_ASSERT(pBuf);

  /////////////////////////////////////////////////////////////////////////////////
  #ifdef DIAGNOSTICS
  BB_ASSERT(diagOp == DIAG_NULL);
  diagOp = DIAG_TX_TIFS;
  diagTxTotalCalls++;
  diagTxTifsCalls++;
  #endif
  /////////////////////////////////////////////////////////////////////////////////

#if (LL_ENABLE_TESTER == TRUE)
  /* set Tx access addresses */
  NRF_RADIO->PREFIX0 = (bbTxAccAddr & 0xFF000000) >> 24;
  NRF_RADIO->BASE0   = (bbTxAccAddr & 0x00FFFFFF) <<  8;
  if (invalidateAccAddrOnceTx)
  {
    invalidateAccAddrOnceTx = FALSE;

    /* invalidate */
    NRF_RADIO->PREFIX0 = ((bbTxAccAddr ^ 0xFFFFFFFF) & 0xFF000000) >> 24;
    NRF_RADIO->BASE0   = ((bbTxAccAddr ^ 0xFFFFFFFF) & 0x00FFFFFF) <<  8;
  }

  uint16_t hdr;
  BYTES_TO_UINT16(hdr, pBuf);

  if ((hdr & bbModifyTxHdrMask) == bbModifyTxHdrValue)
  {
    if (bbTxAccAddrInvalidChanMask & (UINT64_C(1) << bbChanIndex))
    {
      if ((bbTxAccAddrInvalidAdjMask & (1 << bbTxAccAddrInvalidStep)) || bbTxAccAddrShiftMask)
      {
        if (bbTxAccAddrShiftMask)
        {
          uint32_t invalidAA = (1 << bbTxAccAddrInvalidStep) ^ bbTxAccAddr;

          NRF_RADIO->PREFIX0 = (invalidAA & 0xFF000000) >> 24;
          NRF_RADIO->BASE0   = (invalidAA & 0x00FFFFFF) <<  8;
        }
        else
        {
          /* invalidate */
          NRF_RADIO->PREFIX0 = ((bbTxAccAddr ^ 0xFFFFFFFF) & 0xFF000000) >> 24;
          NRF_RADIO->BASE0   = ((bbTxAccAddr ^ 0xFFFFFFFF) & 0x00FFFFFF) <<  8;
        }
      }

      if (!bbTxAccAddrShiftMask)
      {
        if (++bbTxAccAddrInvalidStep > 31)
        {
          bbTxAccAddrInvalidStep = 0;
        }
      }
      else
      {
        if (bbTxAccAddrShiftInc)
        {
          ++bbTxAccAddrInvalidStep;
        }
        else
        {
          --bbTxAccAddrInvalidStep;
        }

        if (bbTxAccAddrInvalidStep > 20 && bbTxAccAddrShiftInc)
        {
          bbTxAccAddrInvalidStep = 31;
          bbTxAccAddrShiftInc = FALSE;
        }
        else if (bbTxAccAddrInvalidStep < 12 && !bbTxAccAddrShiftInc)
        {
          bbTxAccAddrInvalidStep = 1;
          bbTxAccAddrShiftInc = TRUE;
        }
      }
    }
  }

  /* set Tx CRC init */
  NRF_RADIO->CRCINIT = bbTxCrcInit;
  if ((hdr & bbModifyTxHdrMask) == bbModifyTxHdrValue)
  {
    if (bbTxCrcInitInvalidChanMask & (UINT64_C(1) << bbChanIndex))
    {
      if (bbTxCrcInitInvalidAdjMask & (1 << bbTxCrcInitInvalidStep))
      {
        /* invalidate */
        NRF_RADIO->CRCINIT = bbTxCrcInit ^ 0xFFFFFF;
      }

      if (++bbTxCrcInitInvalidStep > 31)
      {
        bbTxCrcInitInvalidStep = 0;
      }
    }
  }
#endif

  /* configure radio hardware registers for transmit */
  palBbTxHwRadioConfig(pBuf);

  /* -----------------------------------------------------------------------------*
   *                             TIFS "Ramping Up"
   * -----------------------------------------------------------------------------*/
  if (tifsState == TIFS_TX_RAMPUP)
  {
    /* assert that the READY-to-START shortcut is not set */
    BB_ASSERT((NRF_RADIO->SHORTS & RADIO_SHORTS_READY_START_Msk) == 0);

    /* radio should be ramping up, set shortcuts (previously READY-to-START shortcut was not set) */
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk   |
                        RADIO_SHORTS_END_DISABLE_Msk;

    /* if the READY event has already happened... TIFS almost certainly did not go out */
    if (NRF_RADIO->EVENTS_READY)
    {
      /* but maybe, just maybe, TIFS did go out... */
      if (NRF_RADIO->STATE != RADIO_STATE_STATE_Tx)
      {
        /////////////////////////////////////////////////////////////////////////////////
        #ifdef DIAGNOSTICS
        diagTxTifsFailMissed++;
        #endif
        /////////////////////////////////////////////////////////////////////////////////

