ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
    /* configure PCNF1 */
    NRF_RADIO->PCNF1 = (((uint32_t)(  0   /* maximum packet length  */ ))  << RADIO_PCNF1_MAXLEN_Pos  )  |
                       (((uint32_t)(  0   /* static packet length   */ ))  << RADIO_PCNF1_STATLEN_Pos )  |
                       (((uint32_t)( NORDIC_BASE_ADDR_LEN              ))  << RADIO_PCNF1_BALEN_Pos   )  |
                       (((uint32_t)( RADIO_PCNF1_ENDIAN_Little         ))  << RADIO_PCNF1_ENDIAN_Pos  )  |
                       (((uint32_t)( bbRadioPcnf1WhiteEn               ))  << RADIO_PCNF1_WHITEEN_Pos );

    /* set packet pointer to the soon-to-be encrypted buffer */
    NRF_RADIO->PACKETPTR = (uint32_t)&bbEncryptOutBuf[0];

    /* get length from packet to transmit */
    bbTxLen = pTxBuf[1];
    BB_ASSERT(bbTxLen <= ENC_MAX_PAYLOAD_LEN); /* payload exceeds Nordic's maximum possible for encryption */

    /* construct header in Nordic format */
    bbEncryptTxBuf[0] = pTxBuf[0];  /* field "H" */
    bbEncryptTxBuf[1] = bbTxLen;    /* field "L" */
    bbEncryptTxBuf[2] = 0;          /* field "RFU" */

    /* copy the payload into Nordic format transmit buffer */
    memcpy(&bbEncryptTxBuf[3], &pTxBuf[2], bbTxLen);
    BB_ASSERT(bbEncryptTxBuf[sizeof(bbEncryptTxBuf)-1] == 0xAA);  /* buffer overrun from memcpy */
    BB_ASSERT(bbEncryptTxBuf[sizeof(bbEncryptTxBuf)-2] == 0xAA);  /* buffer overrun from memcpy */

    NRF_CCM->ENABLE = (CCM_ENABLE_ENABLE_Disabled << CCM_ENABLE_ENABLE_Pos);
    NRF_CCM->ENABLE = (CCM_ENABLE_ENABLE_Enabled  << CCM_ENABLE_ENABLE_Pos);

    NRF_CCM->CNFPTR     = (uint32_t)bbEncryptCcmData;
    NRF_CCM->SCRATCHPTR = (uint32_t)bbEncryptScratchBuf;

    NRF_CCM->INPTR  = (uint32_t)bbEncryptTxBuf;
    NRF_CCM->OUTPTR = (uint32_t)bbEncryptOutBuf;

    uint32_t ccmModeDatarate;
    switch (bbTxPhy)
    {
      default:
      case BB_PHY_BLE_1M:
        ccmModeDatarate = CCM_MODE_DATARATE_1Mbit << CCM_MODE_DATARATE_Pos;
        break;
      case BB_PHY_BLE_2M:
        ccmModeDatarate = CCM_MODE_DATARATE_2Mbit << CCM_MODE_DATARATE_Pos;
        break;
#if defined(NRF52840_XXAA)
      case BB_PHY_BLE_CODED:
        ccmModeDatarate = ((bbTxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? CCM_MODE_DATARATE_500Kbps : CCM_MODE_DATARATE_125Kbps)
                          << CCM_MODE_DATARATE_Pos;
        break;
#endif
    }

    NRF_CCM->MODE = (CCM_MODE_MODE_Encryption << CCM_MODE_MODE_Pos) |
                    (ccmModeDatarate) |
                    (CCM_MODE_LENGTH_Extended << CCM_MODE_LENGTH_Pos);

    NRF_CCM->EVENTS_ENDCRYPT = 0;
    NRF_CCM->EVENTS_ENDKSGEN = 0;
    NRF_CCM->EVENTS_ERROR    = 0;

    /* ---------- handle MIC suppression ---------- */
    if (bbEncryptTxSuppressMic)
    {
      /* set the length field in output buffer to 0xFF, used to detect when it has been populated via DMA */
      bbEncryptOutBuf[1] = 0xFF;

      /* clear the ENDKSGEN event, aka "key-stream generation complete" event */
      WAIT_FOR_WR_BUF_EMPTY(NRF_CCM->EVENTS_ENDKSGEN);

      /* enable the ENDKSGEN interrupt, this interrupt will revert length to original "MIC-less" length */
      NRF_CCM->INTENSET = CCM_INTENSET_ENDKSGEN_Msk;
    }
    /* -------------------------------------------- */

#if (LL_ENABLE_TESTER)
    if ((llTesterCb.pktMic) || (llTesterCb.pktLlId))
    {
      /* clear the ENDCRYPT event */
      WAIT_FOR_WR_BUF_EMPTY(NRF_CCM->EVENTS_ENDCRYPT);

      /* enable the ENDCRYPT interrupt, this interrupt will modify the MIC/LLID */
      NRF_CCM->INTENSET = CCM_INTENSET_ENDCRYPT_Msk;
    }
#endif

    /* set shortcut to start encryption immediately after key generation */
    NRF_CCM->SHORTS = CCM_SHORTS_ENDKSGEN_CRYPT_Msk;  // TODO - probably just need to set once at initialization *****

    /* start encryption */
    NRF_CCM->TASKS_KSGEN = 1;
  }
}

/*************************************************************************************************/
/*!
 *  \brief      CCM interrupt handler "Key-stream Generation Complete"
 *
 *  \param      None.
 *
 *  This interrupt undoes Nordic's automatic +4 to the length field. This allows transmitting
 *  without the MIC.
 */
/*************************************************************************************************/
void CCM_AAR_IRQHandler(void)
{
  if (bbEncryptTxSuppressMic)
  {
    BB_ASSERT(NRF_CCM->INTENSET == CCM_INTENSET_ENDKSGEN_Msk); /* only keygen complete should be enabled */

    /* -----------------------------------------------------------------------------*
    *                         ENDKSGEN - Key Generation Complete
    * -----------------------------------------------------------------------------*/
    BB_ASSERT(NRF_CCM->EVENTS_ENDKSGEN); /* this event should have been set */

    /* disable this interrupt */
    NRF_CCM->INTENCLR = CCM_INTENCLR_ENDKSGEN_Msk;

    /*
     *  The key-stream generation has just completed. A shortcut should immediately
     *  start encryption which populates the output buffer. The second byte of the
     *  output buffer will be the length. Nordic automatically adds four to account for
     *  the addition of the MIC. To avoid transmitting the MIC in the "MIC-less" mode,
     *  this interrupt readjusts the length before it gets transmitted.
     */

    /* wait for the length field to be populated by the Nordic hardware */
    while (bbEncryptOutBuf[1] == 0xFF)
    {
      ///////////////////////////////////////////////////////////////////////////////
      #ifdef BB_ASSERT_ENABLED
      uint8_t busycount = 0;
      BB_ASSERT(busycount < 10); /* got stuck */
      busycount++;
      #endif
      ///////////////////////////////////////////////////////////////////////////////
    }

    /* overwrite with the length field with the original length, that does not include the MIC */
    BB_ASSERT(bbTxLen == (bbEncryptOutBuf[1] - 4));  /* the populated length should be exactly +4 */
    bbEncryptOutBuf[1] = bbTxLen;
  }

#if (LL_ENABLE_TESTER)
  if ((llTesterCb.pktMic) || (llTesterCb.pktLlId))
  {
    BB_ASSERT(NRF_CCM->EVENTS_ENDCRYPT); /* this event should have been set */

    /* disable this interrupt */
    NRF_CCM->INTENCLR = CCM_INTENCLR_ENDCRYPT_Msk;

    bbEncryptOutBuf[0] ^= llTesterCb.pktLlId & 0x03;

