ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
  /* configure PCNF1 */
  NRF_RADIO->PCNF1  = (((uint32_t)( len - PDU_HEADER_LEN        /* max len    */ ))  << RADIO_PCNF1_MAXLEN_Pos  )  |
                      (((uint32_t)( 0                           /* static len */ ))  << RADIO_PCNF1_STATLEN_Pos )  |
                      (((uint32_t)( NORDIC_BASE_ADDR_LEN                         ))  << RADIO_PCNF1_BALEN_Pos   )  |
                      (((uint32_t)( RADIO_PCNF1_ENDIAN_Little                    ))  << RADIO_PCNF1_ENDIAN_Pos  )  |
                      (((uint32_t)( bbRadioPcnf1WhiteEn                          ))  << RADIO_PCNF1_WHITEEN_Pos );

  /* set up memory location where received packet gets stored */
  NRF_RADIO->PACKETPTR = (uint32_t)pRxBuf;

  /* set the mode */
  palBbSetRadioMode(bbRxPhy, bbTxPhyOptions);

  /* remember where the receive buffer is located, used later when processing the completed receive */
  bbpRxBuf = pRxBuf;
}

/*************************************************************************************************/
/*!
 *  \brief      TIMER0 interrupt handler "RX Timeout"
 *
 *  \param      None.
 *
 *  This is the "RX Timeout" interrupt. No other functionality is shared on the TIMER0 interrupt.
 *  If the receive operation has not gotten started, it is cancelled.
 *
 */
/*************************************************************************************************/
void BbBleDrvTimerIRQHandler(void)
{
  BB_ASSERT(NRF_TIMER0->INTENSET == TIMER_INTENSET_COMPARE1_Msk); /* only RX timeout should be enabled */

  /* -----------------------------------------------------------------------------*
   *                         COMPARE1 - "RX Timeout"
   * -----------------------------------------------------------------------------*/
  BB_ASSERT(NRF_TIMER0->EVENTS_COMPARE[1]);
  BB_ASSERT(driverState == RX_STATE); /* an RX timeout should only occur for an RX */
  BB_ASSERT(NRF_RADIO->STATE == RADIO_STATE_STATE_Rx); /* should only be timeout if receiver is actually on */

  /* disable this interrupt */
  NRF_TIMER0->INTENCLR = TIMER_INTENCLR_COMPARE1_Msk;

  /*   Once the ADDRESS event has happened, the receive will not be timed out. This event happens
   *   just after the incoming preamble/address has been recognized.
   */
  if (NRF_RADIO->EVENTS_ADDRESS == 0)
  {
    /* stop the radio */
    palBbRadioHardStop();

    /* send notification of timeout */
    bbRxCallback(BB_STATUS_RX_TIMEOUT, 0, 0, 0, 0);
  }
}

/*************************************************************************************************/
/*!
 *  \brief      Radio interrupt handler.
 *
 *  \param      None.
 *
 *  This the radio interrupt service routine.  It is at the heart of the baseband driver
 *  design. It handles the following interrupts:
 *
 *  1) READY or "TIFS Expired" Interrupt - This interrupt fires as soon as the radio
 *     ramps up and is 'ready'. It is used as timeout for any TIFS operation that may
 *     be coming up. Also, it enables the RX Timeout interrupt if a receive operation.
 *
 *  2) PAYLOAD or "Timestamp/TIFS Setup" Interrupt - This interrupt fires once the payload
 *     has completed, for either transmit or receive.  During this interrupt, the timestamp
 *     is collected and computed. The next potential TIFS operation is also set up.
 *
 *  3) DISABLED or "TX-RX Complete" Interrupt - This interrupt occurs at the completion of
 *     a receive or transmit. It runs the appropriate callback with the appropriate status.
 *     (NOTE: This interrupt is intentionally *not* the END interrupt, for bulletproof timing.)
 *
 */
/*************************************************************************************************/
void BbBleDrvRadioIRQHandler(void)
{
  /* -----------------------------------------------------------------------------*
   *                       READY  -  "TIFS Expired"
   * -----------------------------------------------------------------------------*/
  if ((NRF_RADIO->INTENSET & RADIO_INTENSET_READY_Msk) && NRF_RADIO->EVENTS_READY)
  {
    /* clear the event, leave the interrupt active */
    NRF_RADIO->EVENTS_READY = 0;
    WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_READY);

    /* disable the PPI channel of TX/RX operations */
    NRF_PPI->CHENCLR = PPI_CHENCLR_CH14_Msk;  /* COMPARE[0] -> TXEN/RXEN */

    /* see if a TIFS operation is ramping up, and if so, see if it failed */
    if ( ((tifsState == TIFS_TX_RAMPUP) && (NRF_RADIO->STATE == RADIO_STATE_STATE_TxIdle)) ||
         ((tifsState == TIFS_RX_RAMPUP) && (NRF_RADIO->STATE == RADIO_STATE_STATE_RxIdle)))
    {
      palBbRadioHardStop();  /* note: tifs state is reset in this function */
      return;
    }

    if ((driverState == TX_STATE) || (tifsState == TIFS_TX_RAMPUP))
    {
      BB_LED_TX_ON();
      BB_ASSERT(NRF_RADIO->STATE == RADIO_STATE_STATE_Tx);
    }

    /* if this is a receive, activate the pre-configured RX timeout */
    if ((driverState == RX_STATE) || (tifsState == TIFS_RX_RAMPUP))
    {
      BB_ASSERT(NRF_RADIO->STATE == RADIO_STATE_STATE_Rx);
      BB_LED_RX_ON();

      /* clear the ADDRESS event, it will indicate if an RX timeout is possible */
      NRF_RADIO->EVENTS_ADDRESS = 0;
      WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_ADDRESS);

      /* enable the RX interrupt */
      NRF_TIMER0->INTENSET = TIMER_INTENSET_COMPARE1_Msk;

      /*  if the compare event is set, the RX timeout already occurred */
      if (NRF_TIMER0->EVENTS_COMPARE[1])
      {
        /* force a compare event, which will trigger the interrupt (it was disabled when the actual event happened) */
        NRF_TIMER0->EVENTS_COMPARE[1] = 1;
      }
    }

    /* update tifs state */
    tifsState = TIFS_NULL;
  }

  /* -----------------------------------------------------------------------------*
   *                      PAYLOAD  -  "Timestamp/TIFS Setup"
   * -----------------------------------------------------------------------------*/
  else if ((NRF_RADIO->INTENSET & RADIO_INTENSET_PAYLOAD_Msk) && NRF_RADIO->EVENTS_PAYLOAD)
  {
    /* clear the event, leave the interrupt active */
    NRF_RADIO->EVENTS_PAYLOAD = 0;
    WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_PAYLOAD);

    /* disable the "RX Timeout" interrupt (timer COMPARE1 event) */
    NRF_TIMER0->INTENCLR = TIMER_INTENCLR_COMPARE1_Msk;
    NVIC_ClearPendingIRQ(TIMER0_IRQn); /* necessary, if interrupt already "fired" this is the only way to clear it */

