ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
      /*
       *  Calculate the 'start' timestamp.  It is "antenna time" of the first packet bit.
       *
       *  The timestamp is derived from the a previous timer capture (held in CC[2]) that occurred at PAYLOAD event.
       *  It calculated by subtracting back from payload complete to the packet start.
       *
       *  The PDU payload length was retrieved from the incoming buffer of the last receive packet.
       */
      timestamp = NRF_TIMER0->CC[2] - (TICKS_PER_USEC * NRF5x_PROP_DELAY_RX_USECS);
      switch(bbRxPhy)
      {
        case BB_PHY_BLE_1M:
          timestamp -= (TICKS_PER_USEC * LL_BLE_US_PER_BYTE_1M * ( LL_PREAMBLE_LEN_1M +   /* preamble */
                                                                   LL_AA_LEN          +   /* address */
                                                                   PDU_HEADER_LEN     +   /* PDU header */
                                                                   pduLen ));             /* PDU payload */

#if defined(NRF52840_XXAA)
          timestamp -= (2 * TICKS_PER_USEC);   /* Adjustment based on the sniffer trace observation. */
#endif
          break;
        case BB_PHY_BLE_2M:
          timestamp -= (TICKS_PER_USEC * LL_BLE_US_PER_BYTE_2M * ( LL_PREAMBLE_LEN_2M +   /* preamble */
                                                                   LL_AA_LEN          +   /* address */
                                                                   PDU_HEADER_LEN     +   /* PDU header */
                                                                   pduLen ));             /* PDU payload */

#if defined(NRF52840_XXAA)
          timestamp += (3 * TICKS_PER_USEC);   /* Adjustment based on the sniffer trace observation. */
#endif
          break;
#if defined(NRF52840_XXAA)
        case BB_PHY_BLE_CODED:
          byteRate = (bbRxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? LL_BLE_US_PER_BYTE_CODED_S2 : LL_BLE_US_PER_BYTE_CODED_S8;
          correction = (bbRxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? 20 : 160;
          timestamp -= (TICKS_PER_USEC * LL_BLE_US_PER_BIT_CODED_S8 * ( LL_PREAMBLE_LEN_CODED_BITS +   /* preamble */
                                                                        LL_AA_LEN * 8              +   /* address */
                                                                        LL_CI_LEN_BITS             +   /* CI */
                                                                        LL_TERM1_LEN_BITS)         +   /* TERM1 */
                                           TICKS_PER_USEC * byteRate * ( PDU_HEADER_LEN            +   /* PDU header */
                                                                        pduLen ));                     /* PDU payload */
          timestamp -= TICKS_PER_USEC * correction;                                                    /* Empirical value */

          /* Adjustment based on the sniffer trace observation. */
          timestamp += ((bbRxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? -29 : -20) * TICKS_PER_USEC;
          break;
#endif
        default:
          timestamp -= (TICKS_PER_USEC * LL_BLE_US_PER_BYTE_1M * ( LL_PREAMBLE_LEN_1M +   /* preamble */
                                                                     LL_AA_LEN        +   /* address */
                                                                     PDU_HEADER_LEN   +   /* PDU header */
                                                                     pduLen ));           /* PDU payload */
      }


#if (USE_RTC_BB_CLK)
      /* RTC event start time plus timestamp from HFCLK timer.  */
      timestampUsesc = BB_TICKS_TO_US(bbEventStartTime)  + bbDueOffsetUsec + TICKS_TO_USEC(timestamp);
      /* Handle wraparound. */
      if (timestampUsesc > BB_RTC_MAX_VALUE_US)
      {
        timestampUsesc -= BB_RTC_MAX_VALUE_US;
      }
#else
      timestampUsesc = BB_TICKS_TO_US(timestamp);
#endif

      /* compute RSSI value at antenna end */
      rssi = (int8_t)(-(NRF_RADIO->RSSISAMPLE & 0x7F)) - PalRadioGetRxRfPathComp();
      /* update driver state, *before* callback */
      driverState = IDLE_STATE;
      BB_LED_OFF();

      /* Follow Rx PHY options */
      bbTxPhyOptions = bbRxPhyOptions;

      /* Overwrite with TIFS preference */
      if (tifsTxPhyOptions)
      {
        bbTxPhyOptions = tifsTxPhyOptions;
      }

      /* see if the CRC failed */
      if ((NRF_RADIO->CRCSTATUS & RADIO_CRCSTATUS_CRCSTATUS_Msk) == RADIO_CRCSTATUS_CRCSTATUS_CRCError)
      {
        /* CRC error - run the callback function */
        bbRxCallback(BB_STATUS_CRC_FAILED, rssi, NRF_RADIO->RXCRC, timestampUsesc, bbRxPhyOptions);
      }
      else
      {
        /* Success! - run the callback function */
        bbRxCallback(BB_STATUS_SUCCESS, rssi, NRF_RADIO->RXCRC, timestampUsesc, bbRxPhyOptions);
      }
    }

    /* - - - - - - - - - - - - - - - - - - - - - - - - - *
     *                 Illegal State
     * - - - - - - - - - - - - - - - - - - - - - - - - - */
    else
    {
      BB_ASSERT(0);  /* most likely IDLE state, if not it is completely unknown */

      /*
       *  Ah ah. You tried this, NRF_RADIO->TASKS_DISABLE = 1, didn't you?
       *  Not allowed! Only palBbRadioHardStop() is permitted to do that.
       */
    }
  }

  /* -----------------------------------------------------------------------------*
   *                               Unexpected Interrupt
   * -----------------------------------------------------------------------------*/
  else
  {
    BB_ASSERT(0);
  }
}

/*************************************************************************************************/
/*!
 *  \brief      Cancel TIFS timer.
 *
 *  This stops any active TIFS timer operation. This routine is always called in the callback
 *  (i.e. ISR) context.
 */
/*************************************************************************************************/
void PalBbBleCancelTifs(void)
{
  BB_ASSERT(driverState == IDLE_STATE);  /* driver must be idle */

  /* hard stop will kill any TIFS ramping up */
  palBbRadioHardStop();
  palBbRestoreTrl();
}

/*************************************************************************************************/
/*!
 *  \brief      Cancel a pending transmit or receive.
 *
 *  This stops any active radio operation. This routine is never called in the callback
 *  (i.e. ISR) context.
 */
/*************************************************************************************************/
void PalBbBleCancelData(void)
{
  BB_ASSERT(driverState != NULL_STATE);  /* driver must be initialized */
  BB_ASSERT(driverState != SLEEP_STATE); /* driver cannot be asleep */

  /* cancel RX timeout if active */
  NRF_TIMER0->INTENCLR = TIMER_INTENCLR_COMPARE1_Msk;  /* disable interrupt */
  NVIC_ClearPendingIRQ(TIMER0_IRQn); /* just in case we are running in interrupt context above TIMER0 */

  /* stop radio */
  palBbRadioHardStop();
  palBbRestoreTrl();

  ///////////////////////////////////////////////////////////////////////////////
  #ifdef DIAGNOSTICS
  diagCancels++;

  /* update diagnostics */
  if (diagOp != DIAG_NULL)
  {
    if ((diagOp == DIAG_TX) || (diagOp == DIAG_TX_TIFS))
    {
      diagTxTotalCalls--;
      if (diagOp == DIAG_TX) { diagTxCalls--; }
      else                   { diagTxTifsCalls--; }
    }
    else if ((diagOp == DIAG_RX) || (diagOp == DIAG_RX_TIFS))
    {
      diagRxTotalCalls--;
      if (diagOp == DIAG_RX) { diagRxCalls--; }
      else                   { diagRxTifsCalls--; }
    }
    else
    {
      BB_ASSERT(0); /* unknown value for diagOp */
    }

    /* finally, set to NULL */
    diagOp = DIAG_NULL;
  }
  #endif
  ///////////////////////////////////////////////////////////////////////////////
}

/*===============================================================================================*/
/*!
 *  \brief      Hard stop of the radio.
 *
 *  \param      None.
 *
 *  Immediately stops the radio. All radio interrupts are cancelled. The radio is put into
 *  the disabled state. This function does not return until the disabled state is verified.
 *
 */
/*===============================================================================================*/
static void palBbRadioHardStop(void)
{
  /* hard stop of all radio interrupts */
  NVIC_DisableIRQ(RADIO_IRQn);

  /* Workaround for TX idle failure in Coded PHY */
  NRF_RADIO->TASKS_RXEN = 1;

