ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
  /* keep account of each operation-result */
  if (diagOp == DIAG_RX)
  {
    if      (status == BB_STATUS_SUCCESS)           { diagRxSuccess++; }
    else if (status == BB_STATUS_FAILED)            { diagRxFail++; }
    else if (status == BB_STATUS_RX_TIMEOUT)        { diagRxTimeout++; }
    else if (status == BB_STATUS_CRC_FAILED)        { diagRxCrcFail++; }
    else { BB_ASSERT(0); } /* unexpected status for the operation */
  }
  else if (diagOp == DIAG_RX_TIFS)
  {
    if      (status == BB_STATUS_SUCCESS)           { diagRxTifsSuccess++; }
    else if (status == BB_STATUS_FAILED)            { diagRxTifsFail++; }
    else if (status == BB_STATUS_RX_TIMEOUT)        { diagRxTifsTimeout++; }
    else if (status == BB_STATUS_CRC_FAILED)        { diagRxTifsCrcFail++; }
    else { BB_ASSERT(0); } /* unexpected status for the operation */
  }
  else
  {
    BB_ASSERT(0); /* unexpected operation */
  }

  /* extra integrity check, make sure the accounting adds up */
  BB_ASSERT(diagRxTotalCalls  == (uint16_t)( diagRxSuccess +
                                              diagRxFail +
                                              diagRxTimeout +
                                              diagRxCrcFail +
                                              diagRxTifsSuccess +
                                              diagRxTifsFail +
                                              diagRxTifsTimeout +
                                              diagRxTifsCrcFail ));

  BB_ASSERT(diagRxCalls       == (uint16_t)( diagRxSuccess +
                                              diagRxFail +
                                              diagRxTimeout +
                                              diagRxCrcFail ));

  BB_ASSERT(diagRxTifsCalls   == (uint16_t)( diagRxTifsSuccess +
                                              diagRxTifsFail +
                                              diagRxTifsTimeout +
                                              diagRxTifsCrcFail ));

  BB_ASSERT(diagRxFail     == (uint16_t)(diagRxFailBadDueTime + diagRxFailMissedDueTime));
  BB_ASSERT(diagRxTifsFail == (uint16_t)(diagRxTifsFailMissed + diagRxTifsFailNotPossible));

  /* keep track of last operation */
  diagOpLast = diagOp;
  diagOp = DIAG_NULL;
  diagLastStatus = status;

  /* finally, run the user specified callback, everything else is just diagnostics */
  diagRxCallback(status, rssi, crc, timestamp);
}
#endif

/////////////////////////////////////////////////////////////////////////////////
